package task10;


/*
	Модифицировать генератор запросов чтобы создать эмулятор запросов на год
	добавить в запросы и резульататы дату. Сгенерировать 100 запросов,
	с некорорым распредением по году
	выдать отчет по этим отчетам сколько куплено по месяцам, всего за год, среднее в мес
	всего за доставку затраты, сколько в месяц ошибок в данных.

 */

public class Main {
	public static void main(String[] args) {

		// TODO: 10/18/19 добавил тебе чекстаил, запускается он при сборке мавеном на этапе validate.
		//  Посмотри репорт, все конечно не пофиксить, но гововся, в спринговом проекте он будет в обязательном порядке
		//  поставь плагин в идее sonarLint и начинай фиксить комментарии хотя бы major
		//  это не самые веселые аспекты работы, но это важнейшие пункты в резюме.

	}
}
