package task1;

public class SmallTaskDividing {

	public static void main(String[] args) {
		// TODO: 2/4/20 создать 10 фигур(круг, квадрат, прямоугольник) вывести на печать порядковый номер фигуры с наибольшей площадью
		//  важно сосредоточиться на архитектурных аспектах, нежели не самой реализации
		//  в каждом методе в том чилсе main должно быть не более 10 строк кода. Можно иметь не ограниченно число методов и вспомогательных классов.
		//  Например, ShapesProvider, SquareComparator и тд
	}
}
