package task2;


// TODO: 10/25/19 лучше соблюдать конвенции. Я добавил мавен - плагин чекстайл. Его можно запустить коммандой validate. Сейчас не стоит заострять на
//  этом осбенно внимание, он выдает 97 ошибок все их фиксить тоже не стоит. Но способствовать точу стобы их перечень рос тоже не стоит. Хм
//  правда тут нашел не он а Сонар, тогда выкрути просто на максимум инспектора в шляпе в самом правом нижнем углу.
public enum Skills {
    MakeCoffe,
    DocumentArchiving,
    AnswerThePhone,
    Singing,
    Cooking,
    Coding,


}
