package task9;

/*
    Создать пакетный подбор пакетов насосов, т.е пакеты(массивы) Json-фаилов
    при формировании того же отчета что и в задаче #8
    - совсем не понимаю задание, перефразируйте, пожалуйста

    реализовать поведение при не корректных данных ввода, например, расход
    или напор пропущены или содержат не числовое значение.
    - тут тоже нужна небольшая подсказка)

    В этом случае расчитать среднюю стоимость всего КП и предложить ее на замену
    при этом в моделе указать !Соответсвтующее предупреждение!,
    итоговый отчет формируется в том же формате

*/

public class Main {

	public static void main(String[] args) {

	}
}
